app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("name", "price", "quantity", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?, ?, ?)  [["name", "SONY TV"], ["price", 50000], ["quantity", 20], ["created_at", "2023-03-27 14:08:23.469428"], ["updated_at", "2023-03-27 14:08:23.469428"], ["description", "43 inch LED"]]